apache/nuttx/arch/arm/src/stm32l1/hardware/stm32l15xxx_rcc.h
#define RCC_APB1ENR_TIM2EN          (1 << 0)  /* Bit 0:  Timer 2 clock enable */
#define RCC_APB1ENR_TIM3EN          (1 << 1)  /* Bit 1:  Timer 3 clock enable */
#define RCC_APB1ENR_TIM4EN          (1 << 2)  /* Bit 2:  Timer 4 clock enable */
#define RCC_APB1ENR_TIM5EN          (1 << 3)  /* Bit 3:  Timer 5 clock enable */
#define RCC_APB1ENR_TIM6EN          (1 << 4)  /* Bit 4:  Timer 6 clock enable */
#define RCC_APB1ENR_TIM7EN          (1 << 5)  /* Bit 5:  Timer 7 clock enable */
                                              /* Bits 6-8: Reserved */
#define RCC_APB1ENR_LCDEN           (1 << 9)  /* Bit 9:  LCD clock enable */
                                              /* Bit 10: Reserved */
#define RCC_APB1ENR_WWDGEN          (1 << 11) /* Bit 11: Window Watchdog clock enable */
                                              /* Bits 12-13: Reserved */
#define RCC_APB1ENR_SPI2EN          (1 << 14) /* Bit 14: SPI 2 clock enable */
#define RCC_APB1ENR_SPI3EN          (1 << 15) /* Bit 15: SPI 3 clock enable */
                                              /* Bit 16: Reserved */
#define RCC_APB1ENR_USART2EN        (1 << 17) /* Bit 17: USART 2 clock enable */
#define RCC_APB1ENR_USART3EN        (1 << 18) /* Bit 18: USART 3 clock enable */
#define RCC_APB1ENR_UART4EN         (1 << 19) /* Bit 19: UART 4 clock enable */
#define RCC_APB1ENR_UART5EN         (1 << 20) /* Bit 20: UART 5 clock enable */
#define RCC_APB1ENR_I2C1EN          (1 << 21) /* Bit 21: I2C 1 clock enable */
#define RCC_APB1ENR_I2C2EN          (1 << 22) /* Bit 22: I2C 2 clock enable */
#define RCC_APB1ENR_USBEN           (1 << 23) /* Bit 23: USB clock enable */
                                              /* Bits 24-27: Reserved */
#define RCC_APB1ENR_PWREN           (1 << 28) /* Bit 28: Power interface clock enable */
#define RCC_APB1ENR_DAC1EN          (1 << 29) /* Bit 29: DAC1 interface clock enable */
                                              /* Bit 30: Reserved */
#define RCC_APB1ENR_COMPEN          (1 << 31) /* Bit 31: COMP interface clock enable */

/* AHB peripheral clock enable in low power mode register */

#define RCC_AHBLPENR_GPIOPALPEN     (1 << 0)  /* Bit 0:  I/O port A clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPBLPEN     (1 << 1)  /* Bit 1:  I/O port B clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPCLPEN     (1 << 2)  /* Bit 2:  I/O port C clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPDLPEN     (1 << 3)  /* Bit 3:  I/O port D clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPELPEN     (1 << 4)  /* Bit 4:  I/O port E clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPHLPEN     (1 << 5)  /* Bit 5:  I/O port H clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPFLPEN     (1 << 6)  /* Bit 6:  I/O port F clock enable during sleep mode */
#define RCC_AHBLPENR_GPIOPGLPEN     (1 << 7)  /* Bit 7:  I/O port G clock enable during sleep mode */
                                              /* Bits 8-11: Reserved */
#define RCC_AHBLPENR_CRCLPEN        (1 << 12) /* Bit 12: CRC clock enable during sleep mode */
                                              /* Bits 13-14: Reserved */
#define RCC_AHBLPENR_FLITFLPEN      (1 << 15) /* Bit 15: FLITF clock enable during sleep mode */
#define RCC_AHBLPENR_SRAMLPEN       (1 << 16) /* Bit 16: SRAM clock enable during sleep mode */
                                              /* Bits 17-23: Reserved */
#define RCC_AHBLPENR_DMA1LPEN       (1 << 24) /* Bit 24: DMA1 clock enable during sleep mode */
#define RCC_AHBLPENR_DMA2LPEN       (1 << 25) /* Bit 25: DMA2 clock enable during sleep mode */
                                              /* Bit 26: Reserved */
#define RCC_AHBLPENR_AESLPEN        (1 << 27) /* Bit 27: AES clock enable during sleep mode */
                                              /* Bits 28-29: Reserved */
#define RCC_AHBLPENR_FSMCLPEN       (1 << 30) /* Bit 30: FSMC clock enable during sleep mode */
                                              /* Bit 31: Reserved */

/* APB2 peripheral clock enable in low power mode register */

#define RCC_APB2LPENR_SYSCFGLPEN    (1 << 0)  /* Bit 0:  System configuration controller clock enable during sleep mode */
                                              /* Bit 1:  Reserved */
#define RCC_APB2LPENR_TIM9LPEN      (1 << 2)  /* Bit 2:  TIM9 timer clock enable during sleep mode */
#define RCC_APB2LPENR_TIM10LPEN     (1 << 3)  /* Bit 3:  TIM10 timer clock enable during sleep mode */
#define RCC_APB2LPENR_TIM11LPEN     (1 << 4)  /* Bit 4:  TIM11 timer clock enable during sleep mode */
                                              /* Bits 5-8: Reserved */
#define RCC_APB2LPENR_ADC1LPEN      (1 << 9)  /* Bit 9:  ADC1 interface clock enable during sleep mode */
                                              /* Bit 10: Reserved */
#define RCC_APB2LPENR_SDIOLPEN      (1 << 11) /* Bit 11: SDIO clock enable during sleep mode */
#define RCC_APB2LPENR_SPI1LPEN      (1 << 12) /* Bit 12: SPI 1 clock enable during sleep mode */
                                              /* Bit 13: Reserved */
#define RCC_APB2LPENR_USART1LPEN    (1 << 14) /* Bit 14: USART1 clock enable during sleep mode */
                                              /* Bits 15-31: Reserved */

/* APB1 peripheral clock enable in low power mode register */

#define RCC_APB1LPENR_TIM2LPEN      (1 << 0)  /* Bit 0:  Timer 2 clock enable during sleep mode */
#define RCC_APB1LPENR_TIM3LPEN      (1 << 1)  /* Bit 1:  Timer 3 clock enable during sleep mode */
#define RCC_APB1LPENR_TIM4LPEN      (1 << 2)  /* Bit 2:  Timer 4 clock enable during sleep mode */
#define RCC_APB1LPENR_TIM5LPEN      (1 << 3)  /* Bit 3:  Timer 5 clock enable during sleep mode */
#define RCC_APB1LPENR_TIM6LPEN      (1 << 4)  /* Bit 4:  Timer 6 clock enable during sleep mode */
#define RCC_APB1LPENR_TIM7LPEN      (1 << 5)  /* Bit 5:  Timer 7 clock enable during sleep mode */
                                              /* Bits 6-8: Reserved */
#define RCC_APB1LPENR_LCDLPEN       (1 << 9)  /* Bit 9:  LCD clock enable during sleep mode */
                                              /* Bit 10: Reserved */
#define RCC_APB1LPENR_WWDGLPEN      (1 << 11) /* Bit 11: Window Watchdog clock enable during sleep mode */
                                              /* Bits 12-13: Reserved */
#define RCC_APB1LPENR_SPI2LPEN      (1 << 14) /* Bit 14: SPI 2 clock enable during sleep mode */
#define RCC_APB1LPENR_SPI3LPEN      (1 << 15) /* Bit 15: SPI 3 clock enable during sleep mode */
                                              /* Bit 16: Reserved */
#define RCC_APB1LPENR_USART2LPEN    (1 << 17) /* Bit 17: USART 2 clock enable during sleep mode */
#define RCC_APB1LPENR_USART3LPEN    (1 << 18) /* Bit 18: USART 3 clock enable during sleep mode */
#define RCC_APB1LPENR_UART4LPEN     (1 << 19) /* Bit 19: UART 4 clock enable during sleep mode */
#define RCC_APB1LPENR_UART5LPEN     (1 << 20) /* Bit 20: UART 5 clock enable during sleep mode */
#define RCC_APB1LPENR_I2C1LPEN      (1 << 21) /* Bit 21: I2C 1 clock enable during sleep mode */
#define RCC_APB1LPENR_I2C2LPEN      (1 << 22) /* Bit 22: I2C 2 clock enable during sleep mode */
#define RCC_APB1LPENR_USBLPEN       (1 << 23) /* Bit 23: USB clock enable during sleep mode */
                                              /* Bits 24-27: Reserved */
#define RCC_APB1LPENR_PWRLPEN       (1 << 28) /* Bit 28: Power interface clock enable during sleep mode */
#define RCC_APB1LPENR_DACLPEN       (1 << 29) /* Bit 29: DAC interface clock enable during sleep mode */
                                              /* Bit 30: Reserved */
#define RCC_APB1LPENR_COMPLPEN      (1 << 31) /* Bit 31: COMP interface clock enable during sleep mode */

/* Control/status register */

